package com.adidyk;

/**
 * Class StartUi.
 */
public class StartUi {

    /**
     * main - main.
     * @param arg - arg.
     */
    public  static void main(String[] arg) {
        System.out.println("viber-bot");

        /*
        Вайбер бот.  ( частные чаты  1 на 1, бот - юзер ) реализация до 10 диалогов, в каждом до 5 кнопок,
        1 диалог с продукцией, (фото - описание - цена), БД - гугл ексель или мускл.
        После подтверждения заказа - идет добавление заказа в ексель табличку и минусуется общий вес товара
        из основной таблицы. Тематика бота СЫР.
        Язык :  Java
        Нагрузка до 1000 запросов в день.
        Логи : Стандартные логи Джавы.
        Рамещение ПО : где то
        Сроков как таковых нету.  По сложности вроде не.
         */
    }

}